Domain –Educationfocus –Data analysisBusiness challenge/requirementYou are a data analyst with the University of Cal USA (Not a machine learning expert yet as you still have not completed the ML with Python Course :-)). 

TheUniversity has data on Math, Physics,and Data Structure scoresof sophomore students. This data is stored in different files. The University has hired a data science company to do an analysis of scores and find if there is any correlation between scores with age, ethnicity,etc. Before the data is given to the company you have to do data wrangling.Key issuesEnsure student’s identity is not revealed   to the agency and only relevant data is shared 

Considerations NONE Data volume-In thousands, but only around 1800 records are shared in files MathScoreTerm1.csv DSScoreTerm1.csv, PhysicsScoreTerm1.csvAdditional information-NABusiness benefitsUniversity can get more students enrollment by improving their international ranking through personalized courses/curriculafor students

Approach to SolveYou have to use the fundamentals of Numpy and Pandas covered in module 4.  


1.Read the three CSVfiles which contain the score of the same students in term1 ofeach Subject

2.Remove the name and ethnicity column (to ensure confidentiality)

3.Fill missing score data with zero

4.Merge the three files

5.Change Sex(M/F) Columnto 1/2 for further analysis

6.Store the data in a new file –ScoreFinal.csvEnhancements for code

You can try these enhancements in code

1.Convert ethnicity to a numericalvalue

2.Fill the missing score for a student to the average of the class

In [2]:
import pandas as pd
import numpy as np

In [3]:
#1.Read the three CSVfiles which contain the score of the same students in term1 ofeach Subject

DS=pd.read_csv('DSScoreTerm1.csv')
math=pd.read_csv('MathScoreTerm1.csv')
phy=pd.read_csv('PhysicsScoreTerm1.csv')

In [27]:
#2.Remove the name and ethnicity column (to ensure confidentiality)
ds_new=DS.drop(['Name','Ethinicity'],axis=1)

math_new=math.drop(['Name','Ethinicity'],axis=1)
phy_new=phy.drop(['Name','Ethinicity'],axis=1)

In [17]:
#3.Fill missing score data with zero
ds_new.isnull().sum()

Score      8
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [28]:
math_new.isnull().sum()

Score      3
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [29]:
phy_new.isnull().sum()

Score      6
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

#### so here Score has 8 value which is null so we can impute it to mean

In [30]:
ds_new.fillna(np.mean(ds_new[['Score']]),inplace=True)
math_new.fillna(np.mean(math_new[['Score']]),inplace=True)
phy_new.fillna(np.mean(phy_new[['Score']]),inplace=True)

In [31]:
ds_new.isnull().sum()

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [36]:
#4.Merge the three files
whole_dataset_1=pd.merge(ds_new,math_new,on=['ID','Sex'])
whole_dataset_2=pd.merge(whole_dataset_1,phy_new,on=['ID','Sex'])

In [38]:
whole_dataset_2.head()

,Score_x,Age_x,Subject_x,Sex,ID,Score_y,Age_y,Subject_y,Score,Age,Subject
0,82.0,18,Data Structue,M,1,88.0,18,Maths,84.0,18,Physics
1,79.0,19,Data Structue,M,2,85.0,19,Maths,81.0,19,Physics
2,39.0,19,Data Structue,M,3,45.0,19,Maths,41.0,19,Physics
3,76.0,18,Data Structue,M,4,82.0,18,Maths,78.0,18,Physics
4,76.0,18,Data Structue,F,5,82.0,18,Maths,78.0,18,Physics

In [39]:
#5.Change Sex(M/F) Columnto 1/2 for further analysis
sex={'M':1,'F':2}
whole_dataset_2['Sex']=whole_dataset_2['Sex'].map(sex)

In [40]:
whole_dataset_2.head()

,Score_x,Age_x,Subject_x,Sex,ID,Score_y,Age_y,Subject_y,Score,Age,Subject
0,82.0,18,Data Structue,1,1,88.0,18,Maths,84.0,18,Physics
1,79.0,19,Data Structue,1,2,85.0,19,Maths,81.0,19,Physics
2,39.0,19,Data Structue,1,3,45.0,19,Maths,41.0,19,Physics
3,76.0,18,Data Structue,1,4,82.0,18,Maths,78.0,18,Physics
4,76.0,18,Data Structue,2,5,82.0,18,Maths,78.0,18,Physics

In [41]:
#6.Store the data in a new file –ScoreFinal.csvEnhancements for code
whole_dataset_2.to_csv('score.csv',index=False)

In [ ]:
#we can all chnage this score term and round it with 2 decimal places.
#we can use get_dummies or labelEncoder() to ethinicty and can change the categorical to the numerical one
#we can use imputer(strategy=median) for filling average values to null one